{"title":"Introducing CRUTCH, Our New Metric For Asterisking NBA Champions","description":"The official haters guide for salty fans.","url":"https://pudding.cool/2023/06/crutch","keywords":"nba, injuries, playoffs, champions, asterisk, crutch","hed":"Introducing CRUTCH, Our New Metric For Asterisking NBA Champions","intro":[{"type":"text","value":"At The Pudding, we’ve been contemplating NBA history since <a href=https://pudding.cool/?search=nba target=_blank rel=noreferrer>2016</a>, always powered by metrics from <a href=https://fivethirtyeight.com/features/introducing-raptor-our-new-metric-for-the-modern-nba/ target=_blank rel=noreferrer>other sources.</a>"},{"type":"text","value":"But that changes this year. CRUTCH, which stands for <strong>C</strong>hampionship <strong>R</strong>evisions <strong>U</strong>tilizing <strong>T</strong>op <strong>C</strong>ompetitor <strong>H</strong>ealth, is The Pudding’s first (and last) NBA statistic. We’re pretty excited about it. In addition to being a statistic that we bake in house, CRUTCH fulfills two long-standing goals of ours:</p>"},{"type":"ul","value":["First, we wanted to create a publicly available statistic that takes advantage of a contrived acronym.","Second, and relatedly, we wanted a statistic that builds upon our other statistic, LIMP (<strong>L</strong>eveled <strong>I</strong>njury <strong>M</strong>inus/<strong>P</strong>lus)."]},{"type":"text","value":"With so many injuries this year, we wanted to offer fans support when their team inevitably loses. Thanks to CRUTCH, you can now complain, with data."}],"limpAbridged":"<strong>L</strong>eveled <strong>I</strong>njury <strong>M</strong>inus/<strong>P</strong>lus simply takes into account injured players from the winner as well, yielding a net effect.","limpDetailed":"Leveled Injury Minus/Plus computes the net difference between the winner’s asterisk score and their opponent each round. It then takes the average across all rounds, taking into account top missing players from both teams, not just the opponent.","method":[{"type":"text","value":"Player rankings were determined by calculating the average of a player’s previous two played seasons <a href=https://github.com/fivethirtyeight/data/tree/master/nba-raptor target=_blank rel=no_referrer>RAPTOR WAR scores</a>. Two seasons were chosen to take into account missed seasons or big stretches due to injuries to get a better sense of where they stood in the league."},{"type":"text","value":"The asterisk score starts with assigning two points to a top 30 missing player, and one point to a top 150 player for each game. Each round gets an average score (which normalizes by number of games played), and then an average is calculated across all rounds.  A team’s asterisk score is mapped to zero to three actual asterisks."},{"type":"text","value":"Data for the reason behind a missed game is inconsistent. Typically, “Did Not Play” refers to a deep bench player not getting minutes. For better players, it is usually a data entry generalization. Therefore, Only DNPs for top 150 players count as missed games, while deep bench players require being listed as inactive or another specific reason to register as a missed game. This only affects the opponent charts, since only top 150 players are factored into the asterisk calculation."},{"type":"text","value":"Introduction text is a parody of Five Thirty Eight’s <a href=https://fivethirtyeight.com/features/introducing-raptor-our-new-metric-for-the-modern-nba/ target=_blank rel=no_referrer>RAPTOR blog.</a>"}]}